In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib as plt
from pydataset import data
print('Success')

Success

In a jupyter notebook, classification_exercises.ipynb, use a python module (pydata or seaborn datasets) containing datasets as a source from the iris data. Create a pandas dataframe, df_iris, from this data.

1. print the first 3 rows
2. print the number of rows and columns (shape)
3. print the column names
4. print the data type of each column
5. print the summary statistics for each of the numeric variables. Would you recommend rescaling the data based on these statistics?

In [2]:
df_iris = data('iris') 
df_iris.head(3)

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
1           5.1          3.5           1.4          0.2  setosa
2           4.9          3.0           1.4          0.2  setosa
3           4.7          3.2           1.3          0.2  setosa

In [3]:
df_iris.columns

Index(['Sepal.Length', 'Sepal.Width', 'Petal.Length', 'Petal.Width',
       'Species'],
      dtype='object')

In [4]:
df_iris.dtypes

Sepal.Length    float64
Sepal.Width     float64
Petal.Length    float64
Petal.Width     float64
Species          object
dtype: object

In [5]:
df_iris.describe()
# Would you recommend rescaling the data based on these statistics? - Yes

       Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

Read the Table1_CustDetails table from the Excel_Exercises.xlsx file into a dataframe named df_excel.

1. assign the first 100 rows to a new dataframe, df_excel_sample
2. print the number of rows of your original dataframe
3. print the first 5 column names
4. print the column names that have a data type of object
5. compute the range for each of the numeric variables.

In [6]:
sheet_url = 'https://docs.google.com/spreadsheets/d/16tPJXOKksadffKXGIQnSgdckinr4hs-pMzJgsR8B5EQ/edit#gid=96538250'    

csv_export_url = sheet_url.replace('/edit#gid=', '/export?format=csv&gid=')

df_excel = pd.read_csv(csv_export_url)
df_excel['tenure'] = round(df_excel['total_charges']/df_excel['monthly_charges'], 0)
df_excel['tenure'].fillna(0, inplace = True)
df_excel.head(1)

,customer_id,gender,is_senior_citizen,partner,dependents,phone_service,internet_service,contract_type,payment_type,monthly_charges,total_charges,churn,tenure
0,0002-ORFBO,Female,0,Yes,Yes,1,1,1,Mailed check,65.6,593.3,No,9.0

In [7]:
df_excel_sample = df_excel.head(100)

In [8]:
len(df_excel.index)

7049

In [9]:
df_excel.columns[0:5]

Index(['customer_id', 'gender', 'is_senior_citizen', 'partner', 'dependents'], dtype='object')

In [10]:
list(df_excel.select_dtypes(include=['object']).columns)

['customer_id', 'gender', 'partner', 'dependents', 'payment_type', 'churn']

In [11]:
spread = df_excel[['monthly_charges', 'total_charges', 'tenure']].describe().transpose()
spread['range'] = spread['max'] - spread['min']
spread[['range']]

                  range
monthly_charges   100.5
total_charges    8666.0
tenure             79.0

Read the data from this google sheet into a dataframe, df_google

1. print the first 3 rows
2. print the number of rows and columns
3. print the column names
4. print the data type of each column
5. print the summary statistics for each of the numeric variables
6. print the unique values for each of your categorical variables

In [12]:
sheet_url = 'https://docs.google.com/spreadsheets/d/1Uhtml8KY19LILuZsrDtlsHHDC9wuDGUSe8LTEwvdI5g/edit#gid=341089357'    

csv_export_url = sheet_url.replace('/edit#gid=', '/export?format=csv&gid=')
df_google = pd.read_csv(csv_export_url)
df_google.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [13]:
df_google.shape

(891, 12)

In [14]:
df_google.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [15]:
df_google.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [16]:
df_google[['Age', 'Fare']].describe()

              Age        Fare
count  714.000000  891.000000
mean    29.699118   32.204208
std     14.526497   49.693429
min      0.420000    0.000000
25%     20.125000    7.910400
50%     28.000000   14.454200
75%     38.000000   31.000000
max     80.000000  512.329200

In [17]:
print(f"Survived = {df_google['Survived'].unique()}")
print(f"Pclass = {df_google['Pclass'].unique()}")
print(f"Embarked = {df_google['Embarked'].unique()}")

Survived = [0 1]
Pclass = [3 1 2]
Embarked = ['S' 'C' 'Q' nan]